"""
Задача №2

Шаховий ферзь («королева») ходить по діагоналі, горизонталі або вертикалі.
Дано дві різні клітинки шахової дошки, визначте,
чи може ферзь потрапити з першої клітинки на другу за один хід.
Програма отримує на вхід чотири числа від 1 до 8 кожне,
що задають номер стовпця і номер рядка спочатку для першої клітинки,
потім для другої клітинки. Програма повинна вивести Yes,
якщо з першої клітинки ходом ферзя
можна потрапити в другу або No в іншому випадку.

Виконала: Гриб Наталія Григорівна, 31І група
"""

x1 = int(input("Введіть номер стовпця для першої клітинки (1-8): "))
y1 = int(input("Введіть номер рядка для першої клітинки (1-8): "))
x2 = int(input("Введіть номер стовпця для другої клітинки (1-8): "))
y2 = int(input("Введіть номер рядка для другої клітинки (1-8): "))

if x1 == x2 or y1 == y2 or abs(x1 - x2) == abs(y1 - y2):
    print ("Yes")
else:
    print ("No")
